---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SplitToposolidFailures.GenerateNewSplitTopoFailed
source: html/3d11d110-67d1-223b-4503-33c82931ec97.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplitToposolidFailures.GenerateNewSplitTopoFailed Property

Failed to generate new toposolid after split.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenerateNewSplitTopoFailed { get; }
```